W6D3/FRaC/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" LEFT OUTER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE (artist_id = '1' OR viewer_id = '1')
SELECT "artworks".* FROM "artworks"
---
    def index

        if params[:user_id]
            artworks = Artwork.left_outer_joins(:artwork_shares).where("artist_id = :user_id OR viewer_id = :user_id", user_id: params[:user_id])
            render json: artworks
        else
            artworks = Artwork.all