W6D3/FRaC/app/controllers/users_controller.rb

    def create
        # user = User.new(params.require(:user).permit(:name, :email))
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Carlos"], ["email", "carlos@gmail.com"], ["created_at", "2020-06-17 20:10:23.024234"], ["updated_at", "2020-06-17 20:10:23.024234"]]

    def update
        @user = User.find(params[:id]) #User.find_by(name: params[:name])

        if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Alex"], ["updated_at", "2020-06-17 21:03:34.495928"], ["id", 3]]